Repository: ESUCC/Maximd
Catalog: application/translation/form004/page2.tmx
Source language: es
Languages: en

source: Consideraciones Especiales
en: Special Considerations

source: Complete todas las opciones que apliquen, de lo contrario explíque por qué no aplica
en: complete all that apply, otherwise explain why this item does not apply

source: Fortalezas del estudiante
en: Student's strengths

source: Si el estudiante va a cumplir 16 años de edad (o más) durante este IEP, indique las fortalezas relacionadas con el área de transición, incluyendo empleo, capacitación después de la secundaria (preparatoria), habilidades para desenvolverse en la vida diaria y participación comunitaria
en: If the student will turn 16 (or older) during this IEP, indicate strengths related to the area of transition, including employment, post-secondary training, daily living skills, and community involvement

source: Información de los padres, incluyendo lo que les preocupa mejorar de la educación de su hijo
en: Parental information, including concerns for enhancing their child's education

source: Si el estudiante tiene 14 años de edad o más, indique las preocupaciones relacionadas con el área de transición, incluyendo empleo, capacitación adicional posterior, habilidades para desenvolverse en la vida diaria y participación comunitaria
en: If the student is age 14 or older, indicate concerns related to the area of transition including employment, post-secondary training, daily living skills and community involvement

source: Resultados de evaluación(es) inicial(es) o reciente(es)
en: Results of initial or recent evaluation(s)

source: esto debe incluir no sólo un informe de las calificaciones de las evaluaciones, sino también una explicación de los resultados
en: this should include not only a report of test scores, but also an explanation of the results

source: Los resultados del desempeño del niño en cualquier evaluación general a nivel estatal y del distrito
en: Results of child's performance on any general state and district-wide assessments

source: Si la conducta impide el aprendizaje, considerar el uso de intervenciones y estrategias de conducta positivas
en: If behavior impedes learning, consideration of the use of positive behavioral interventions and strategies

source: Si el estudiante tiene aptitud limitada del idioma inglés, considerar las necesidades del idioma
en: If student has Limited English proficiency, consideration of language needs

source: Si el niño es ciego o visualmente discapacitado, el IEP deberá proporcionar enseñanza del braille el cual debe usarse , a menos que después de una evaluación se determine que el braille y su uso no es apropiado para el niño
en: If the student is blind or visually impaired, the IEP shall provide Braille instruction and the use of Braille, unless after an evaluation it is determined that Braille, and the use of Braille is not appropriate for the child

source: Considerar las necesidades de comunicación del niño
en: Consideration of the child's communication needs

source: Para niños sordos o con problemas de audición considerar las 3 siguientes áreas
en: For children who are deaf or hard of hearing consideration of the following 3 areas

source: Necesidades de comunicación e idioma del niño
en: Child's language and communication needs

source: Oportunidades de comunicación directa con compañeros y profesionales en el modo de comunicación y lenguaje del niño
en: Opportunities for direct communication with peers and professionals in the child's language and communication mode

source: Nivel académico y oportunidades de instrucción directa en el modo de comunicación y lenguaje del niño
en: Academic level and opportunities for direct instruction in the child's language and communication mode

source: Considerar que el niño necesita servicios o dispositivos tecnológicos de ayuda
en: Consideration of the child's need for assistive technology service or device

source: Se considera aunque no es necesario
en: Considered but not necessary
